Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: As usual, we can configure everything in the Quarkus configuration file, `application.properties`.
ja_jp: いつものように、Quarkusの設定ファイル（ `application.properties` ）ですべての設定を行うことができます。

source: As usual, we wrote a https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0[migration guide]. As expected for a new major, it is more dense than for our usual minors.
ja_jp: 例によって、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0[移行ガイド] を書きました。さすがに新しいメジャーだけあって、いつものマイナー向けよりも濃い内容になっています。

source: As usual, we wrote a https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0[very comprehensive migration guide] to help you update to Quarkus 3.0.
ja_jp: いつものように、Quarkus 3.0へのアップデートを支援するために、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0[非常に包括的なマイグレーションガイド] を書きました。

source: As usual, we're always improving, so take a look at link:https://github.com/quarkiverse/quarkiverse/wiki#joining-quarkiverse[Joining Quarkiverse] for the process we are currently using.
ja_jp: 他と同様に、我々は常に改善していますので、現在使用しているプロセスについては、 https://github.com/quarkiverse/quarkiverse/wiki#joining-quarkiverse[Joining Quarkiverse]をご覧ください。

source: As usual, you can install the extension using `add-extension`.
ja_jp: 通常通り、 `add-extension` を使ってエクステンションをインストールします。

source: As was mentioned above, `quarkus:info`, besides reporting Quarkus platform and extension versions, performs a quick version alignment check, to make sure the extension versions used in the project are compatible with the imported Quarkus platform BOMs. If misalignments are detected, the following warning message will be logged:
ja_jp: 前述のように、 `quarkus:info` は、Quarkus プラットフォームとエクステンションのバージョンを報告するだけでなく、プロジェクトで使用されるエクステンションのバージョンがインポートされた Quarkus プラットフォームの BOM と互換性があることを確認するために、バージョンの整合性をすばやくチェックします。不整合が検出された場合、以下の警告メッセージがログに記録されます。

source: As was mentioned previously, the base project files (pom.xml, Dockerfiles, ...) are already generated by the base codestarts provided by the Quarkus core. Thanks to this, we can only focus on the starter code specific to the extension.
ja_jp: 前述したように、プロジェクトの基本ファイル (pom.xml、Dockerfile など) は、Quarkus コアが提供するベース Codestart ですでに生成されています。このおかげで、エクステンションのスターターコードにのみ集中することができます。

source: As was mentioned previously, the base project files (pom.xml, dockerfiles, ...) are already generated by base codestarts provided by the Quarkus core. Thanks to this, we can only focus on the important - the starter code for the extension.
ja_jp: 前述したように、プロジェクトの基本ファイル（pom.xml、dockerfileなど）は、Quarkusコアが提供する基本コードスタートですでに生成されています。このおかげで、私たちは重要なこと、つまりエクステンションのスターターコードにのみ集中することができます。

source: As we `index` collection of objects we should use `index`, `create` or `update` action.
ja_jp: オブジェクトのコレクションを `index` するときは、 `index`、 `create`、または `update` アクションを使用する必要があります。

source: As we already described in the https://quarkus.io/blog/smallrye-stork-intro/[previous post], SmallRye Stork is a service discovery and client-side load-balancing framework that brings out-of-the-box integration with Kubernetes, among others. This post will explain this integration, how to configure Stork in a client-side microservice, and how it differs from the classic Kubernetes service discovery and load-balancing.
ja_jp: 前回の link:https://quarkus.io/blog/smallrye-stork-intro/[エントリ]で紹介したように、SmallRye Storkはサービスディスカバリーとクライアントサイドのロードバランシングのフレームワークで、Kubernetesなどとの統合をすぐに実現します。この記事では、この統合について、クライアントサイドのマイクロサービスにStorkを設定する方法、そして従来のKubernetesのサービスディスカバリーとロードバランシングとの違いについて説明します。

source: As we are writing in a database, we must be in a transaction. This annotation starts a new transaction and commits it when the method returns. Quarkus automatically considers the method as _blocking_. Indeed, writing to a database using classic Hibernate is blocking. So, Quarkus calls the method on a worker thread you can block (and not an I/O thread).
ja_jp: データベースに書き込んでいるので、トランザクション内である必要があります。このアノテーションは新しいトランザクションを開始し、メソッドが返されたときにそれをコミットします。Quarkus は、このメソッドを自動的に _blocking_ と見なします。実際、従来の Hibernate を使用したデータベースへの書き込みはブロックされています。そこで、Quarkus は、ブロックできるワーカースレッド (I/O スレッドではない) でメソッドを呼び出します。

source: As we are writing to the database, make sure we run inside a transaction
ja_jp: データベースに書き込んでいるときは、トランザクション内で実行していることを確認してください

source: As we can see, we use the micrometer registry facade to create a counter with a tag by name that will be incremented every time it's invoked.
ja_jp: ご覧のように、micrometer レジストリファサードを使用して、タグ名を持つカウンタを作成し、起動するたびにインクリメントしています。

source: As we do not change the root logger, the console log contains only `INFO` or higher level logs.
ja_jp: ここではルートロガーを変更していないため、コンソールログには `INFO` またはそれ以上のレベルのログのみが含まれます。

source: As we don't change the root logger, console log will only contain `INFO` or higher order logs.
ja_jp: ルートロガーを変更しないので、コンソールログには `INFO` 以上の順位のログしか表示されません。

source: As we don't change the root logger, the console log will only contain `INFO` or higher level logs.
ja_jp: ルートロガーを変更しないので、コンソールログには `INFO` またはそれ以上のレベルのログしか含まれません。

source: As we have seen above, non-blocking I/O avoids that problem. A few threads can handle many concurrent I/O. If we go back to the HTTP endpoint example, the request processing is executed on one of these I/O threads. Because there are only a few of them, you need to use them wisely. When the request processing needs to call a remote service, you can't block the thread anymore. You schedule the I/O and pass a continuation, i.e., the code to execute once the I/O completes.
ja_jp: 上で見てきたように、ノンブロッキングI/Oはその問題を回避します。数個のスレッドで多数の同時I/Oを処理することができます。HTTPエンドポイントの例に戻ると、リクエスト処理はこのI/Oスレッドの1つで実行されます。I/Oスレッドは数が少ないので、賢く使いこなす必要があります。リクエスト処理でリモートサービスを呼び出す必要がある場合は、もうスレッドをブロックすることはできません。I/Oをスケジューリングし、継続（continuation、I/Oが完了した後に実行するコード）を渡します。

source: As we have seen above, the API exposes five Rest endpoints. In this section we are going to see how to initialise an increment, see the list of current increments, incrementing a value given its key, retrieving the current value of an increment, and finally deleting a key.
ja_jp: 上で見たように、APIは5つのRestエンドポイントを公開しています。このセクションでは、インクリメントを初期化する方法、現在のインクリメントのリストを見る方法、キーを指定して値をインクリメントする方法、インクリメントの現在の値を取得する方法、そして最後にキーを削除する方法を見ていきます。

source: As we have seen above, the Greeting API exposes two Rest endpoints. In this section we are going to see how to create and display a greeting message.
ja_jp: 上記で見てきたように、Greeting APIは2つのRestエンドポイントを公開しています。このセクションでは、挨拶のメッセージを作成し、表示する方法について紹介します。

source: As we have seen, the event bus is the connecting tissue of Vert.x applications. Quarkus integrates it so different beans can interact with asynchronous messages. This part is covered in the xref:reactive-event-bus.adoc[event bus documentation].
ja_jp: これまで見てきたように、イベントバスはVert.xアプリケーションの接続組織です。 Quarkusはこれを統合し、異なるBeanが非同期メッセージでやり取りできるようにします。 この部分については、 xref:reactive-event-bus.adoc[イベントバスのドキュメント] を参照してください。

source: As we have started our Quarkus application in dev mode simply repeat the request to `http://localhost:8080/q/health/live` by refreshing your browser window or by using `curl http://localhost:8080/q/health/live`. Because we defined our health check to be a liveness procedure (with `@Liveness` qualifier) the new health check procedure is now present in the `checks` array.
ja_jp: Quarkusアプリケーションを開発モードで起動しているので、 `http://localhost:8080/q/health/live` へのリクエストを ブラウザウィンドウを更新するか `curl http://localhost:8080/q/health/live` で単に繰り返してください。ヘルスチェックをlivenessプロシージャ（ `@Liveness` 修飾子付き）と定義したため、新しいヘルスチェックプロシージャが `checks` 配列に存在するようになりました。

source: As we peel further back, we start to see some generated classes that invoke the `create` method in `org.acme.hibernate.orm.FruitResource`. `org.acme.hibernate.orm.FruitResource_ClientProxy` and `org.acme.hibernate.orm.FruitResource_Subclass` both directly call the method. One more interesting call comes from the `FruitResource_create_d0...` method in `com.oracle.svm.core.reflect.ReflectionAccessorHolder`. This essentially means that the `create` method has been registered in GraalVM for access via reflection.
ja_jp: さらにさかのぼると、 `org.acme.hibernate.orm.FruitResource` で `create` メソッドを呼び出す生成クラスがいくつか見られます。 `org.acme.hibernate.orm.FruitResource_ClientProxy` と `org.acme.hibernate.orm.FruitResource_Subclass` は、いずれもこのメソッドを直接呼び出しています。さらに興味深いのは、 `com.oracle.svm.core.reflect.ReflectionAccessorHolder` の `FruitResource_create_d0…​` メソッドからの呼び出しです。これは本質的に、 `create` メソッドが、リフレクションによるアクセスのためにGraalVMに登録されていることを意味します。

source: As we saw in the Hibernate with Panache guide, it allows us to extend the functionality in our entities and repositories (also known as DAOs) with some automatically provided functionality. When using Kotlin, the approach is very similar to what we see in the Java version with a slight change or two. To Panache-enable your entity, you would define it something like:
ja_jp: Hibernate ORM with Panacheガイドで見たように、Hibernate ORM with Panacheを使うと、エンティティーやリポジトリ(DAOとも呼ばれます)の機能を自動で提供される機能で拡張することができます。Kotlin を使用する場合のアプローチは Java 版と非常によく似ていますが、若干の変更点があります。エンティティーを Panache で有効にするには、次のように定義します。

source: As we saw in the MongoDB with Panache guide, it allows us to extend the functionality in our entities and repositories (also known as DAOs) with some automatically provided functionality. When using Kotlin, the approach is very similar to what we see in the Java version with a slight change or two. To Panache-enable your entity, you would define it something like:
ja_jp: MongoDB with Panacheガイドで見たように、これによってエンティティやリポジトリ(DAOとも呼ばれる)の機能を、自動的に提供される機能で拡張することができます。Kotlin を使っている場合は、Java 版と同じようなアプローチになりますが、若干の変更があります。エンティティをPanache対応にするには、次のように定義します。

source: As we shouldn't leave this application with a readiness check in a DOWN state and because we are running Quarkus in dev mode you can add `database.up=true` in `src/main/resources/application.properties` and rerun the readiness health check again -- it should be up again.
ja_jp: このアプリケーションをreadiness チェックを DOWN 状態のままにしておいてはいけないため、また、 Quarkus を開発モードで実行しているため、 `database.up=true` を `src/main/resources/application.properties` に追加し、 readiness ヘルスチェックを再度実行できます。 -- 再びupになるはずです。

source: As we want to use configuration properties obtained from the Config Server, we will update the `GreetingResource` to inject the `message` property. The updated code will look like this:
ja_jp: Config Serverから取得した設定プロパティーを使用したいので、 `GreetingResource` を更新して `message` プロパティーを注入します。更新したコードは以下のようになります。

source: As we were moving away from Tower, we decided to leverage our Kubernetes infrastructure by running _ocpdeploy_ as tasks in Tekton pipelines. This gave us repeatability, a way to deploy different applications, or even different tenants for the same application with different _ocpdeploy_ versions. The use of java (any other high level language would have been a good fit) provided us with a high level of productivity, and maintainable code, while being able to implement complex algorithms for configuration processing, and raised the level of quality of _ocpdeploy_ releases thanks to our extensive regression testing suite.
ja_jp: Tower からの移行に伴い、Tekton パイプラインのタスクとして _ocpdeploy_を実行することで、Kubernetes インフラストラクチャを活用することにしました。これにより、再現性が得られ、異なるアプリケーションや、同じアプリケーションの異なるテナントを異なる _ocpdeploy_バージョンでデプロイすることができました。java (他のハイレベル言語でも可) を使用することで、設定処理のための複雑なアルゴリズムを実装することができる一方で、高いレベルの生産性と保守可能なコードを提供し、広範なリグレッション・テスト・スイートのおかげで _ocpdeploy_のリリースの品質レベルが向上しました。

source: As we will import data into the PostgreSQL database using an SQL script, we need to reindex the data at startup. For this, we use Hibernate Search's mass indexer, which allows to index a lot of data efficiently (you can fine tune it for better performances). All the upcoming updates coming through Hibernate ORM operations will be synchronized automatically to the full text index. If you don't import data manually in the database, you don't need that: the mass indexer should then only be used when you change your indexing configuration (adding a new field, changing an analyzer's configuration...) and you want the new configuration to be applied to your existing entities.
ja_jp: SQLスクリプトを使用してPostgreSQLデータベースにデータをインポートするために起動時にデータのインデックスを再作成する必要があります。Hibernate Searchのマスインデクサーを使用して大量のデータを効率的にインデクシングすることができます（パフォーマンスを向上させるために微調整できます）。Hibernate ORMの操作によるその後のすべての更新は自動的に全文インデックスに同期されます。マスインデクサーを使用するのはインデクシング構成を変更したりして（新しいフィールドの追加、アナライザーの構成の変更など）、新しい構成を既存のエンティティに適用したい場合のみです。

source: As with <<hibernate-dialect-supported-databases,supported databases>>, you can configure the DB version explicitly to get the most out of Hibernate ORM:
ja_jp: <<hibernate-dialect-supported-databases,supported databases>> と同様に、 Hibernate ORM を最大限に活用するために、DB バージョンを明示的に設定できます。

source: As with any optimization effort, the key lies in choosing your battles wisely and carefully weighing the inevitable trade-offs.
ja_jp: 他の最適化の取り組みと同様に、賢明に戦いを選択し、避けられないトレードオフを慎重に検討することが鍵となります。

source: As with most things in life there are some trade offs involved when choosing native compilation over JVM mode. So depending on the application the runtime performance of a native application might be slower compared to JVM mode, though that’s not always the case.
ja_jp: 多くの場合、JVMモードではなくネイティブコンパイルを選択すると、いくつかのトレードオフが発生します。そのため、アプリケーションによっては、ネイティブアプリケーションの実行時パフォーマンスがJVMモードに比べて遅くなることがありますが、絶対にそうであるとは限りません。

source: As with most things in life there are some trade-offs involved when choosing native compilation over JVM mode. So depending on the application the runtime performance of a native application might be slower compared to JVM mode, though that’s not always the case.
ja_jp: 多くの場合、JVM モードではなくネイティブコンパイルを選択すると、いくつかのトレードオフが発生します。そのため、アプリケーションによっては、ネイティブアプリケーションの実行時パフォーマンスが JVM モードに比べて遅くなることがありますが、絶対にそうであるとは限りません。

source: As with the certificate/key file combination, Quarkus will first try to resolve the given path as a resource, before attempting to read it from the filesystem.
ja_jp: 証明書とキーファイルの組み合わせと同様に、 Quarkus はまず、ファイルシステムからの読み込みを試みる前に、指定されたパスをリソースとして解決しようとします。

source: As with the first example this file has the usernames and passwords stored in plain text, which is not recommended. If plain-text is set to false (or omitted) in the config then passwords must be stored in the form `MD5 ( username : realm : password )`. This can be generated for the first example above by running the command `echo -n scott:MyRealm:jb0ss | md5` from the command line.
ja_jp: 最初の例と同様に、このファイルにはユーザー名とパスワードがプレーンテキストで保存されていますが、これは推奨されません。設定でプレーンテキストが false に設定されている (または省略されている) 場合、パスワードは `MD5 ( username : realm : password )` の形式で保存されなければなりません。これは上記の最初の例では、コマンドラインから `echo -n scott:MyRealm:jb0ss | md5` コマンドを実行することで生成することができます。

source: As with the first example, this file has usernames and passwords stored in plain text, which is not recommended. If plain text is set to false (or omitted) in the config, then passwords must be stored in the form `MD5 ( username : realm : password )`. This can be generated for the first example above by running the command `echo -n scott:MyRealm:jb0ss | md5` from the command line.
ja_jp: 最初の例と同様に、このファイルではユーザー名とパスワードがプレーンテキストで保存されていますが、これは推奨されません。コンフィグでプレーンテキストをfalseに設定（または省略）した場合、パスワードは `MD5 ( username : realm : password )` という形式で保存する必要があります。これは、コマンドラインから `echo -n scott:MyRealm:jb0ss | md5` というコマンドを実行することで、上記の最初の例に対して生成することができます。

source: As with the previous `Message` example, if your injected channel receives payloads (`Multi<T>`), it acknowledges the message automatically, and support multiple subscribers. If you injected channel receives Message (`Multi<Message<T>>`), you will be responsible for the acknowledgment and broadcasting. We will explore sending broadcast messages in <<broadcasting-messages-on-multiple-consumers>>.
ja_jp: 前の `Message` の例と同様に、注入されたチャネルがペイロード (`Multi<T>`) を受信する場合、メッセージは自動的に確認応答され、複数のサブスクライバーをサポートします。 一方で、注入されたチャネルがメッセージ (`Multi<Message<T>>`) を受信する場合は、確認応答とブロードキャストを自分で処理する必要があります。 ブロードキャストメッセージの送信については、<<broadcasting-messages-on-multiple-consumers>> で詳しく説明します。

source: As with the previous `Message` example, if your injected channel receives payloads (`Multi<T>`), it acknowledges the message automatically, and support multiple subscribers. If your injected channel receives Message (`Multi<Message<T>>`), you will be responsible for the acknowledgment and broadcasting.
ja_jp: 前出の `Message` の例と同様に、注入されたチャネルがペイロード (`Multi<T>`) を受信した場合は、そのチャネルが自動的にメッセージを確認応答し、複数のサブスクライバーをサポートします。 注入されたチャネルが Message (`Multi<Message<T>>`) を受信した場合は、手動で確認応答とブロードキャストを行う必要があります。

source: As with the previous example we need to configure the connectors in the `application.properties` file. Open the `src/main/resources/application.properties` file and add:
ja_jp: 前述の例と同様に、 `application.properties` ファイルでコネクタを設定する必要があります。 `src/main/resources/application.properties` ファイルを開き、次のように追加します:

source: As with xref:hibernate-dialect-supported-databases[supported databases], you can configure the DB version explicitly to get the most out of Hibernate ORM:
ja_jp: xref:hibernate-dialect-supported-databases[サポートされているデータベース] と同様に、DBバージョンを明示的に設定することで、Hibernate ORMを最大限に活用することができます:

source: As writing bytecode directly is complex, this is instead done via bytecode recorders. At deployment time, invocations are made on recorder objects that contain the actual runtime logic, but instead of these invocations proceeding as normal they are intercepted and recorded (hence the name). This recording is then used to generate bytecode that performs the same sequence of invocations at runtime. This is essentially a form of deferred execution where invocations made at deployment time get deferred until runtime.
ja_jp: バイトコードを直接書くのは複雑なので、代わりにバイトコードレコーダーを使っています。デプロイメント時には、実際の実行時 ロジックを含むレコーダー オブジェクトが呼び出されますが、これらの呼び出しは通常通りに行われるのではなく、インターセプトされて記録されます (これが名前の由来です)。この記録は、実行時に同じ一連の呼び出しを実行するバイトコードを生成するために使用されます。これは本質的には遅延実行の一形態であり、デプロイメント時に行われた呼び出しが実行時まで延期されます。

source: As you can probably guess from the answer to the previous question, the answer is no.
ja_jp: 前の質問の答えからわかる通り、答えは「ノー」です。

source: As you can see `ProtectedResource` returns a name from both `userName()` and `adminName()` methods. The name is extracted from the current `JsonWebToken`.
ja_jp: ご覧のとおり、 `ProtectedResource` は `userName()` と `adminName()` の両方のメソッドから名前を返します。この名前は、現在の `JsonWebToken` から抽出されたものです。

source: As you can see a CSRF token verification will be required at the `/service/user` path accepting the `application/x-www-form-urlencoded` payload, but `User` JSON representation posted to both `/service/user` and `/service/users` method will have no CSRF token and therefore the token verification has to be skipped in these cases by restricting it to the specific `/service/user` request path but also allowing not only `application/x-www-form-urlencoded` on this path:
ja_jp: ご覧のように、 `service/user` パスで `application/x-www-form-urlencoded` ペイロードを受け取る際に CSRF トークン検証が必要になりますが、 `service/user` と `service/users` の両方のメソッドにPOSTされた `User` JSON表現はCSRFトークンを持たないため、これらのケースではトークン検証をスキップする必要があります。この場合、特定の `service/user` リクエストパスに限定し、このパスでは `application/x-www-form-urlencoded` だけを許可しないようにします:

source: As you can see from the xref:security-oidc-configuration-properties-reference.adoc[OIDC Configuration properties reference] document which contains OIDC properties generated from JavaDocs, a number of properties in the `quarkus.oidc.*` namespace is large. Even though only a very minimum number of properties may be required to cover most typical requirements, users may find it difficult to find the right combination.
ja_jp: JavaDocs から生成された OIDC プロパティーを含む xref:security-oidc-configuration-properties-reference.adoc[OIDC 設定プロパティーリファレンス] ドキュメントからわかるように、 `quarkus.oidc.*` 名前空間のプロパティーの数は膨大です。最も一般的な要件をカバーするために必要なプロパティーはごく少数ですが、ユーザーは適切な組み合わせを見つけるのが難しいと感じるかもしれません。

source: As you can see in the previous snippet, you can use xref:config-reference.adoc#profiles[profiles] in YAML.
ja_jp: 前のスニペットでわかるように、YAMLで xref:config-reference.adoc#profiles[プロファイル] を使うことができます。

source: As you can see in the previous snippet, you can use xref:config-reference.adoc#profiles[profiles] in YAML. The profile key requires double quotes: `"%test"`. This is because YAML does not support keys starting with `%`.
ja_jp: 先ほどのスニペットでもわかるように、YAMLで link:config-reference.html#profiles[プロファイル]を使うことができます。プロファイルのキーには二重引用符が必要です: `"%test"`.これはYAMLが `%` で始まるキーをサポートしていないためです。

source: As you can see in this code sample, you do not need to start the test container from the test code.
ja_jp: このコードサンプルからわかるように、テストコードからテストコンテナーを起動する必要はありません。

source: As you can see it does not have any claim representing a user name but if you check its `sub` (subject) claim you will see its value matches what you got in the response when you accessed the Quarkus endpoint directly from the browser, `auth0|60e5a305e8da5a006aef5471`.
ja_jp: ご覧のとおりユーザー名を表すクレームはありませんが、 `sub` (subject) クレームを確認すると、その値が、ブラウザーから直接 Quarkus エンドポイントにアクセスした際にレスポンスとして取得した値 (`auth0|60e5a305e8da5a006aef5471`) と一致することがわかります。

source: As you can see our entities remain simple. There is, however, a slight difference from the Java version. The Kotlin language doesn't support the notion of static methods in quite the same way as Java does. Instead, we must use a https://kotlinlang.org/docs/tutorials/kotlin-for-py/objects-and-companion-objects.html#companion-objects[companion object]:
ja_jp: ご覧のように、私たちのエンティティーはシンプルなままです。しかし、Java版とは少し違いがあります。Kotlin 言語は Java のように静的メソッドの概念をサポートしていません。その代わり、 link:https://kotlinlang.org/docs/tutorials/kotlin-for-py/objects-and-companion-objects.html#companion-objects[コンパニオンオブジェクト] を使わなければなりません。

source: As you can see, CDI is much simpler to work with.
ja_jp: ご覧のとおり、CDI の方が操作がはるかに簡単です。

source: As you can see, Quarkus handles the web socket lifecycle and message handling using annotations. It also serializes and deserializes messages using JSON automatically.
ja_jp: ご覧のとおり、Quarkus はアノテーションを使用して Web ソケットのライフサイクルとメッセージ処理に対応しています。 また、JSON を使用してメッセージを自動的にシリアライズおよびデシリアライズします。

source: As you can see, all your updates are automatically synchronized to the Elasticsearch cluster.
ja_jp: ご覧のように、すべての更新が自動的にElasticsearchクラスタに同期されます。

source: As you can see, creating, implementing and sharing Quarkus extensions with others is actually very easy. So if you have an idea of an extension which could be useful for the community, feel free to pitch your idea by creating a new extension proposal issue on the quarkusio/quarkus GitHub Issues section :-)
ja_jp: このように、Quarkusのエクステンションを作成、実装、他の人と共有することは非常に簡単です。コミュニティにとって有用なエクステンションのアイデアがあれば、quarkusio/quarkus GitHub Issuesセクションに新しいエクステンション提案の課題を作成して、自由にアイデアを提案してください :-)

source: As you can see, in the application code, the bean is injected without a qualifier. The bean name is only used to refer to the bean in the other language.
ja_jp: ご覧のとおり、アプリケーションコードでは、Bean は修飾子なしで注入されます。Bean 名は、他の言語で Bean を参照するためにのみ使用されます。

source: As you can see, testing of the endpoints secured with Auth0 can be done with the help of `Wiremock`, or `@TestSecurity` annotation. Experiment with writing such tests on your own and reach out if you encounter any problems.
ja_jp: このように、Auth0 で保護されたエンドポイントは、 `Wiremock` または `@TestSecurity` アノテーションを使用してテストできます。このようなテストを自分で書いてみて、問題が発生した場合はご連絡ください。

source: As you can see, the access token is no longer encrypted as shown in the <<opaque-access-tokens>> section and indeed it is in the JWT format now.
ja_jp: <<opaque-access-tokens>> セクションに示されているとおりアクセストークンは暗号化されなくなり、JWT フォーマットになります。

source: As you can see, the endpoint runs on a virtual thread.
ja_jp: ご覧のように、エンドポイントは仮想スレッド上で実行されます。

source: As you can see, the health check procedures are defined as CDI beans that implement the `HealthCheck` interface and are annotated with one of the health check qualifiers, such as:
ja_jp: ご覧のように、ヘルスチェックは、 `HealthCheck` インターフェースを実装するCDI Beanとして定義され、次のようなヘルスチェックの修飾子の1つでアノテーションされています:

source: As you can see, the only differences with a managed entity are:
ja_jp: ご覧のとおり、管理対象エンティティーとの唯一の違いは次のとおりです。

source: As you can see, this time, it runs UPX to compress the native executable. If you check the size, you should get something around 15 MB:
ja_jp: ご覧の通り、今回はUPXを実行してネイティブ実行可能ファイルを圧縮しています。サイズを確認すると、15MB前後のものが出てくるはずです。
